nxp-mcuxpresso/mcux-soc-svd/LPC55S66/LPC55S66_cm33_core0.xml
        <register>
          <dim>10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA1_ITRIG_INMUX[%s]</name>
          <description>Trigger select register for DMA1 channel</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 9).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Pin interrupt 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Pin interrupt 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>Pin interrupt 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Pin interrupt 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Timer CTIMER0 Match 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>Timer CTIMER0 Match 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Timer CTIMER2 Match 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Timer CTIMER4 Match 0</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>DMA1 output trigger mux 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>DMA1 output trigger mux 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>DMA1 output trigger mux 2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>DMA1 output trigger mux 3</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>SCT0 DMA request 0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>SCT0 DMA request 1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>HASH DMA RX trigger</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>None</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA1_OTRIG_INMUX[%s]</name>
          <description>DMA1 output trigger selection to become DMA1 trigger</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>DMA trigger output number (decimal value) for DMA channel n (n = 0 to 9).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_REQ_ENA</name>
          <description>Enable DMA0 requests</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FFFFF</resetValue>
          <resetMask>0x7FFFFF</resetMask>
          <fields>
            <field>
              <name>REQ_ENA</name>
              <description>Controls the 23 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_REQ_ENA_SET</name>
          <description>Set one or several bits in DMA0_REQ_ENA register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x7FFFFF</resetMask>
          <fields>
            <field>
              <name>SET</name>
              <description>Write : If bit #i = 1, bit #i in DMA0_REQ_ENA register is set to 1; if bit #i = 0 , no change in DMA0_REQ_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_REQ_ENA_CLR</name>
          <description>Clear one or several bits in DMA0_REQ_ENA register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x7FFFFF</resetMask>
          <fields>
            <field>
              <name>CLR</name>
              <description>Write : If bit #i = 1, bit #i in DMA0_REQ_ENA register is reset to 0; if bit #i = 0 , no change in DMA0_REQ_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_REQ_ENA</name>
          <description>Enable DMA1 requests</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>REQ_ENA</name>
              <description>Controls the 10 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_REQ_ENA_SET</name>
          <description>Set one or several bits in DMA1_REQ_ENA register</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>SET</name>
              <description>Write : If bit #i = 1, bit #i in DMA1_REQ_ENA register is set to 1; if bit #i = 0 , no change in DMA1_REQ_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_REQ_ENA_CLR</name>
          <description>Clear one or several bits in DMA1_REQ_ENA register</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>CLR</name>
              <description>Write : If bit #i = 1, bit #i in DMA1_REQ_ENA register is reset to 0; if bit #i = 0 , no change in DMA1_REQ_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ITRIG_ENA</name>
          <description>Enable DMA0 triggers</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FFFFF</resetValue>
          <resetMask>0x3FFFFF</resetMask>
          <fields>
            <field>
              <name>ITRIG_ENA</name>
              <description>Controls the 22 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ITRIG_ENA_SET</name>
          <description>Set one or several bits in DMA0_ITRIG_ENA register</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FFFFF</resetMask>
          <fields>
            <field>
              <name>SET</name>
              <description>Write : If bit #i = 1, bit #i in DMA0_ITRIG_ENA register is set to 1; if bit #i = 0 , no change in DMA0_ITRIG_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ITRIG_ENA_CLR</name>
          <description>Clear one or several bits in DMA0_ITRIG_ENA register</description>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FFFFF</resetMask>
          <fields>
            <field>
              <name>CLR</name>
              <description>Write : If bit #i = 1, bit #i in DMA0_ITRIG_ENA register is reset to 0; if bit #i = 0 , no change in DMA0_ITRIG_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_ITRIG_ENA</name>
          <description>Enable DMA1 triggers</description>
          <addressOffset>0x7A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FFF</resetValue>
          <resetMask>0x7FFF</resetMask>
          <fields>
            <field>
              <name>ITRIG_ENA</name>
              <description>Controls the 15 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_ITRIG_ENA_SET</name>
          <description>Set one or several bits in DMA1_ITRIG_ENA register</description>
          <addressOffset>0x7A8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x7FFF</resetMask>
          <fields>
            <field>
              <name>SET</name>
              <description>Write : If bit #i = 1, bit #i in DMA1_ITRIG_ENA register is set to 1; if bit #i = 0 , no change in DMA1_ITRIG_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_ITRIG_ENA_CLR</name>
          <description>Clear one or several bits in DMA1_ITRIG_ENA register</description>
          <addressOffset>0x7B0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x7FFF</resetMask>
          <fields>
            <field>
              <name>CLR</name>
              <description>Write : If bit #i = 1, bit #i in DMA1_ITRIG_ENA register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIG_ENA register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
