nxp-mcuxpresso/mcux-soc-svd/LPC55S66/LPC55S66_cm33_core0.xml
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN27_SEC_MASK</name>
              <description>Secure mask for pin P1_27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN28_SEC_MASK</name>
              <description>Secure mask for pin P1_28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN29_SEC_MASK</name>
              <description>Secure mask for pin P1_29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN30_SEC_MASK</name>
              <description>Secure mask for pin P1_30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN31_SEC_MASK</name>
              <description>Secure mask for pin P1_31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CPU_INT_MASK0</name>
          <description>Secure Interrupt mask for CPU1</description>
          <addressOffset>0xF90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_IRQ</name>
              <description>Watchdog Timer, Brown Out Detectors and Flash Controller interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMA0_IRQ</name>
              <description>System DMA 0 (non-secure) interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_GLOBALINT0_IRQ</name>
              <description>GPIO Group 0 interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_GLOBALINT1_IRQ</name>
              <description>GPIO Group 1 interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ0</name>
              <description>Pin interrupt 0 or pattern match engine slice 0 interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ1</name>
              <description>Pin interrupt 1 or pattern match engine slice 1 interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ2</name>
              <description>Pin interrupt 2 or pattern match engine slice 2 interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ3</name>
              <description>Pin interrupt 3 or pattern match engine slice 3 interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UTICK_IRQ</name>
              <description>Micro Tick Timer interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT_IRQ</name>
              <description>Multi-Rate Timer interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER0_IRQ</name>
              <description>Standard counter/timer 0 interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER1_IRQ</name>
              <description>Standard counter/timer 1 interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCT_IRQ</name>
              <description>SCTimer/PWM interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER3_IRQ</name>
              <description>Standard counter/timer 3 interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM0_IRQ</name>
              <description>Flexcomm 0 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM1_IRQ</name>
              <description>Flexcomm 1 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM2_IRQ</name>
              <description>Flexcomm 2 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM3_IRQ</name>
              <description>Flexcomm 3 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM4_IRQ</name>
              <description>Flexcomm 4 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM5_IRQ</name>
              <description>Flexcomm 5 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM6_IRQ</name>
              <description>Flexcomm 6 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM7_IRQ</name>
              <description>Flexcomm 7 interrupt (USART, SPI, I2C, I2S).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_IRQ</name>
              <description>General Purpose ADC interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP_IRQ</name>
              <description>Analog Comparator interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
